src/modules/webhooks/__recordings__/TransactionCancelationRequestedWebhookHandler_2898564197/American-Express-pm_card_amex_1702901941/should-cancel-pre-authorized-card_3641244857/recording.har

{
  "log": {
    "_recordingName": "TransactionCancelationRequestedWebhookHandler/'American Express' 'pm_card_amex'/should cancel pre-authorized card",
    "creator": {
      "comment": "persister:fs",
      "name": "Polly.JS",
      "version": "6.0.5"
    },
    "entries": [
      {
        "_id": "e832e0e9ad4807ac377f5e27c0fd1344",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 239,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "239"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "idempotency-key",
              "value": "stripe-node-retry-54ebe21d-d3f9-40ef-b389-8fee72ba37fe"
            },
            {
              "name": "stripe-version",
              "value": "2023-10-16"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/14.8.0"
            }
          ],
          "headersSize": 814,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "automatic_payment_methods[enabled]=true&automatic_payment_methods[allow_redirects]=never&amount=22299&currency=PLN&capture_method=manual&metadata[transactionId]=555555&metadata[channelId]=1&metadata[checkoutId]=c29tZS1jaGVja291dC1pZA%3D%3D"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents"
        },
        "response": {
          "bodySize": 1695,
          "content": {
            "mimeType": "application/json",
            "size": 1695,
            "text": {
              "amount": 22299,
              "amount_capturable": 0,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 0,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": {
                "allow_redirects": "never",
                "enabled": true
              },
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "manual",
              "client_secret": "pi_FAKE_CLIENT_SECRET",
              "confirmation_method": "automatic",
              "created": 1702477365,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3OMtKjEosEcNBN5m0IMpKdZI",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": null,
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": null,
              "payment_method_configuration_details": {
                "id": "pmc_1LVZxMEosEcNBN5manO2iTW7",
                "parent": null
              },
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                },
                "link": {
                  "persistent_token": null
                },
                "paypal": {
                  "preferred_locale": null,
                  "reference": null
                }
              },
              "payment_method_types": [
                "card",
                "link",
                "paypal"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "requires_payment_method",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET,HEAD,PUT,PATCH,POST,DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1695"
            },
            {
              "name": "content-security-policy",
              "value": "report-uri https://q.stripe.com/csp-report?p=v1%2Fpayment_intents; block-all-mixed-content; default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Wed, 13 Dec 2023 14:22:45 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "stripe-node-retry-54ebe21d-d3f9-40ef-b389-8fee72ba37fe"
            },
            {
              "name": "original-request",
              "value": "req_wQMsaRdx3ch0Wm"
            },
            {
              "name": "request-id",
              "value": "req_wQMsaRdx3ch0Wm"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2023-10-16"
            },
            {
              "name": "vary",
              "value": "Origin"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 1095,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-12-13T14:22:34.853Z",
        "time": 10970,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 10970
        }
      },
      {
        "_id": "09961e1cd5abe26724f68f52a532d4a9",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 27,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "27"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "idempotency-key",
              "value": "stripe-node-retry-b7b7ace3-e56c-4d0e-96f2-a4658918ded1"
            },
            {
              "name": "stripe-version",
              "value": "2023-10-16"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/14.8.0"
            }
          ],
          "headersSize": 849,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "payment_method=pm_card_amex"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents/pi_3OMtKjEosEcNBN5m0IMpKdZI/confirm"
        },
        "response": {
          "bodySize": 2642,
          "content": {
            "mimeType": "application/json",
            "size": 2642,
            "text": {
              "error": {
                "code": "payment_intent_unexpected_state",
                "doc_url": "https://stripe.com/docs/error-codes/payment-intent-unexpected-state",
                "message": "This PaymentIntent's payment_method could not be updated because it has a status of canceled. You may only update the payment_method of a PaymentIntent with one of the following statuses: requires_payment_method, requires_confirmation, requires_action.",
                "param": "payment_method",
                "payment_intent": {
                  "amount": 22299,
                  "amount_capturable": 0,
                  "amount_details": {
                    "tip": {}
                  },
                  "amount_received": 0,
                  "application": null,
                  "application_fee_amount": null,
                  "automatic_payment_methods": {
                    "allow_redirects": "never",
                    "enabled": true
                  },
                  "canceled_at": 1702477367,
                  "cancellation_reason": null,
                  "capture_method": "manual",
                  "client_secret": "pi_3OMtKjEosEcNBN5m0IMpKdZI_secret_yQKx08JxltBGb5fiLraqa2tXA",
                  "confirmation_method": "automatic",
                  "created": 1702477365,
                  "currency": "pln",
                  "customer": null,
                  "description": null,
                  "id": "pi_3OMtKjEosEcNBN5m0IMpKdZI",
                  "invoice": null,
                  "last_payment_error": null,
                  "latest_charge": "ch_3OMtKjEosEcNBN5m0JHUOrqY",
                  "livemode": false,
                  "metadata": {
                    "channelId": "1",
                    "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                    "transactionId": "555555"
                  },
                  "next_action": null,
                  "object": "payment_intent",
                  "on_behalf_of": null,
                  "payment_method": "pm_1OMtKkEosEcNBN5mSqNhoa5a",
                  "payment_method_configuration_details": {
                    "id": "pmc_1LVZxMEosEcNBN5manO2iTW7",
                    "parent": null
                  },
                  "payment_method_options": {
                    "card": {
                      "installments": null,
                      "mandate_options": null,
                      "network": null,
                      "request_three_d_secure": "automatic"
                    },
                    "link": {
                      "persistent_token": null
                    },
                    "paypal": {
                      "preferred_locale": null,
                      "reference": null
                    }
                  },
                  "payment_method_types": [
                    "card",
                    "link",
                    "paypal"
                  ],
                  "processing": null,
                  "receipt_email": null,
                  "review": null,
                  "setup_future_usage": null,
                  "shipping": null,
                  "source": null,
                  "statement_descriptor": null,
                  "statement_descriptor_suffix": null,
                  "status": "canceled",
                  "transfer_data": null,
                  "transfer_group": null
                },
                "request_log_url": "https://dashboard.stripe.com/test/logs/req_opm0NuqwQYrWqW?t=1702477938",
                "type": "invalid_request_error"
              }
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET,HEAD,PUT,PATCH,POST,DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "2642"
            },
            {
              "name": "content-security-policy",
              "value": "report-uri https://q.stripe.com/csp-report?p=v1%2Fpayment_intents%2F%3Aintent%2Fconfirm; block-all-mixed-content; default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Wed, 13 Dec 2023 14:32:18 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "stripe-node-retry-b7b7ace3-e56c-4d0e-96f2-a4658918ded1"
            },
            {
              "name": "original-request",
              "value": "req_opm0NuqwQYrWqW"
            },
            {
              "name": "request-id",
              "value": "req_opm0NuqwQYrWqW"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2023-10-16"
            },
            {
              "name": "vary",
              "value": "Origin"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 1117,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 400,
          "statusText": "Bad Request"
        },
        "startedDateTime": "2023-12-13T14:32:18.339Z",
        "time": 502,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 502
        }
      }
    ],
    "pages": [],
    "version": "1.2"
  }
}
